from openai import OpenAI
import streamlit as st

# Display FAQs
st.title("Вас приветствует команда Elmento AI!")

st.markdown("""
Elmento AI - это российская нейросеть, которая анализирует объёмные файлы в любом расширении: от pdf и word до png и pptx. 

С помощью технологии OCR (компьютерного зрения), нейросеть может читать сканы и фотографии. 

В её функционал также входит создание краткого содержания (сводки) к документам, доступ к модели ChatGPT , ответы на вопросы по любому загруженному файлу и работа с информацией из её собственной базы данных. 

Beta-версия Elmento AI уже предлагает вам множество преимуществ перед другими нейросетями, а мы стараемся делать её лучше. 

Благодарим вас за интерес к Elmento и желаем удачи с вашими задачами!

""")
